GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_aux_evctl.h
/******************************************************************************
*  Filename:       hw_aux_evctl.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AUX_EVCTL_H__
#define __HW_AUX_EVCTL_H__


//*****************************************************************************
//
// This section defines the register offsets of
// AUX_EVCTL component
//
//*****************************************************************************
// Vector Configuration 0
#define AUX_EVCTL_O_VECCFG0                                         0x00000000

// Vector Configuration 1
#define AUX_EVCTL_O_VECCFG1                                         0x00000004

// Sensor Controller Engine Wait Event Selection
#define AUX_EVCTL_O_SCEWEVSEL                                       0x00000008

// Events To AON Domain Flags
#define AUX_EVCTL_O_EVTOAONFLAGS                                    0x0000000C

// Events To AON Domain Polarity
#define AUX_EVCTL_O_EVTOAONPOL                                      0x00000010

// Direct Memory Access Control
#define AUX_EVCTL_O_DMACTL                                          0x00000014

// Software Event Set
#define AUX_EVCTL_O_SWEVSET                                         0x00000018

// Event Status 0
#define AUX_EVCTL_O_EVSTAT0                                         0x0000001C

// Event Status 1
#define AUX_EVCTL_O_EVSTAT1                                         0x00000020

// Event To MCU Domain Polarity
#define AUX_EVCTL_O_EVTOMCUPOL                                      0x00000024

// Events to MCU Domain Flags
#define AUX_EVCTL_O_EVTOMCUFLAGS                                    0x00000028

// Combined Event To MCU Domain Mask
#define AUX_EVCTL_O_COMBEVTOMCUMASK                                 0x0000002C

// Vector Flags
#define AUX_EVCTL_O_VECFLAGS                                        0x00000034

// Events To MCU Domain Flags Clear
#define AUX_EVCTL_O_EVTOMCUFLAGSCLR                                 0x00000038

// Events To AON Domain Clear
#define AUX_EVCTL_O_EVTOAONFLAGSCLR                                 0x0000003C

// Vector Flags Clear
#define AUX_EVCTL_O_VECFLAGSCLR                                     0x00000040

//*****************************************************************************
//
// Register: AUX_EVCTL_O_VECCFG0
//
//*****************************************************************************
// Field: [14]    VEC1_POL
//
// Selects vector 1 trigger event polarity.
//
// To manually trigger vector 1 execution, set VEC1_EV to a known static
// value, and toggle VEC1_POL twice.
// ENUMs:
// RISE                 Rising edge triggers execution.
// FALL                 Falling edge triggers execution.
//
#define AUX_EVCTL_VECCFG0_VEC1_POL                                  0x00004000
#define AUX_EVCTL_VECCFG0_VEC1_POL_BITN                             14
#define AUX_EVCTL_VECCFG0_VEC1_POL_M                                0x00004000
#define AUX_EVCTL_VECCFG0_VEC1_POL_S                                14
#define AUX_EVCTL_VECCFG0_VEC1_POL_RISE                             0x00000000
#define AUX_EVCTL_VECCFG0_VEC1_POL_FALL                             0x00004000

// Field: [13]    VEC1_EN
//
// Enables (1) or disables (0) triggering of vector 1 execution.
//
// When enabled, the edge selected by VEC1_POL on the event selected by
// VEC1_EV will set VECFLAGS.VEC1, which in turn triggers vector 1 execution.
//
// Note: Lower vectors (0) have priority.
// ENUMs:
// DIS                  Event detection is disabled
// EN                   An event selected by VEC1_EV with polarity from
// VEC1_POL triggers a jump to vector # 1 when AUX_SCE is in sleep
//
#define AUX_EVCTL_VECCFG0_VEC1_EN                                   0x00002000
#define AUX_EVCTL_VECCFG0_VEC1_EN_BITN                              13
#define AUX_EVCTL_VECCFG0_VEC1_EN_M                                 0x00002000
#define AUX_EVCTL_VECCFG0_VEC1_EN_S                                 13
#define AUX_EVCTL_VECCFG0_VEC1_EN_DIS                               0x00000000
#define AUX_EVCTL_VECCFG0_VEC1_EN_EN                                0x00002000

// Field: [12:8] VEC1_EV
//
// Selects vector 1 trigger source event.
// ENUMs:
// AON_RTC_CH2          AON_RTC_CH2 event
// AUX_COMPA            AUX_COMPA event
// AUX_COMPB            AUX_COMPB event
// TDC_DONE             TDC_DONE event
// TIMER0_EV            TIMER0_EV event
// TIMER1_EV            TIMER1_EV event
// SMPH_AUTOTAKE_DONE   SMPH_AUTOTAKE_DONE event
// ADC_DONE             ADC_DONE event
// ADC_FIFO_ALMOST_FULL ADC_FIFO_ALMOST_FULL event
// OBSMUX0              OBSMUX0 event
// OBSMUX1              OBSMUX1 event
// AON_SW               AON_SW event
// AON_PROG_WU          AON_PROG_WU event
// AUXIO0               AUXIO0 input data
// AUXIO1               AUXIO1 input data
// AUXIO2               AUXIO2 input data
// AUXIO3               AUXIO3 input data
// AUXIO4               AUXIO4 input data
// AUXIO5               AUXIO5 input data
// AUXIO6               AUXIO6 input data
// AUXIO7               AUXIO7 input data
// AUXIO8               AUXIO8 input data
// AUXIO9               AUXIO9 input data
// AUXIO10              AUXIO10 input data
// AUXIO11              AUXIO11 input data
// AUXIO12              AUXIO12 input data
// AUXIO13              AUXIO13 input data
// AUXIO14              AUXIO14 input data
// AUXIO15              AUXIO15 input data
// ACLK_REF             ACLK_REF event
// MCU_EV               MCU_EV event
// ADC_IRQ              ADC_IRQ event
//
#define AUX_EVCTL_VECCFG0_VEC1_EV_M                                 0x00001F00
#define AUX_EVCTL_VECCFG0_VEC1_EV_S                                 8
#define AUX_EVCTL_VECCFG0_VEC1_EV_AON_RTC_CH2                       0x00000000
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUX_COMPA                         0x00000100
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUX_COMPB                         0x00000200
#define AUX_EVCTL_VECCFG0_VEC1_EV_TDC_DONE                          0x00000300
#define AUX_EVCTL_VECCFG0_VEC1_EV_TIMER0_EV                         0x00000400
#define AUX_EVCTL_VECCFG0_VEC1_EV_TIMER1_EV                         0x00000500
#define AUX_EVCTL_VECCFG0_VEC1_EV_SMPH_AUTOTAKE_DONE                0x00000600
#define AUX_EVCTL_VECCFG0_VEC1_EV_ADC_DONE                          0x00000700
#define AUX_EVCTL_VECCFG0_VEC1_EV_ADC_FIFO_ALMOST_FULL              0x00000800
#define AUX_EVCTL_VECCFG0_VEC1_EV_OBSMUX0                           0x00000900
#define AUX_EVCTL_VECCFG0_VEC1_EV_OBSMUX1                           0x00000A00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AON_SW                            0x00000B00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AON_PROG_WU                       0x00000C00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO0                            0x00000D00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO1                            0x00000E00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO2                            0x00000F00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO3                            0x00001000
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO4                            0x00001100
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO5                            0x00001200
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO6                            0x00001300
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO7                            0x00001400
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO8                            0x00001500
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO9                            0x00001600
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO10                           0x00001700
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO11                           0x00001800
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO12                           0x00001900
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO13                           0x00001A00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO14                           0x00001B00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO15                           0x00001C00
#define AUX_EVCTL_VECCFG0_VEC1_EV_ACLK_REF                          0x00001D00
#define AUX_EVCTL_VECCFG0_VEC1_EV_MCU_EV                            0x00001E00
#define AUX_EVCTL_VECCFG0_VEC1_EV_ADC_IRQ                           0x00001F00

// Field: [6]    VEC0_POL
//
// Selects vector 0 trigger event polarity.
//
// To manually trigger vector 0 execution, set VEC0_EV to a known static
// value, and toggle VEC0_POL twice.
// ENUMs:
// RISE                 Rising edge triggers execution.
// FALL                 Falling edge triggers execution.
//
#define AUX_EVCTL_VECCFG0_VEC0_POL                                  0x00000040
#define AUX_EVCTL_VECCFG0_VEC0_POL_BITN                             6
#define AUX_EVCTL_VECCFG0_VEC0_POL_M                                0x00000040
#define AUX_EVCTL_VECCFG0_VEC0_POL_S                                6
#define AUX_EVCTL_VECCFG0_VEC0_POL_RISE                             0x00000000
#define AUX_EVCTL_VECCFG0_VEC0_POL_FALL                             0x00000040

// Field: [5]    VEC0_EN
//
// Enables (1) or disables (0) triggering of vector 0 execution.
//
// When enabled, the edge selected by VEC0_POL on the event selected by
// VEC0_EV will set VECFLAGS.VEC0, which in turn triggers vector 0 execution.
// ENUMs:
// DIS                  Event detection is disabled
// EN                   An event selected by VEC0_EV with polarity from
// VEC0_POL triggers a jump to vector #0 when AUX_SCE is in sleep
//
#define AUX_EVCTL_VECCFG0_VEC0_EN                                   0x00000020
#define AUX_EVCTL_VECCFG0_VEC0_EN_BITN                              5
#define AUX_EVCTL_VECCFG0_VEC0_EN_M                                 0x00000020
#define AUX_EVCTL_VECCFG0_VEC0_EN_S                                 5
#define AUX_EVCTL_VECCFG0_VEC0_EN_DIS                               0x00000000
#define AUX_EVCTL_VECCFG0_VEC0_EN_EN                                0x00000020

// Field: [4:0] VEC0_EV
//
// Selects vector 0 trigger source event.
// ENUMs:
// AON_RTC_CH2          AON_RTC_CH2 event
// AUX_COMPA            AUX_COMPA event
// AUX_COMPB            AUX_COMPB event
// TDC_DONE             TDC_DONE event
// TIMER0_EV            TIMER0_EV event
// TIMER1_EV            TIMER1_EV event
// SMPH_AUTOTAKE_DONE   SMPH_AUTOTAKE_DONE event
// ADC_DONE             ADC_DONE event
// ADC_FIFO_ALMOST_FULL ADC_FIFO_ALMOST_FULL event
// OBSMUX0              OBSMUX0 event
// OBSMUX1              OBSMUX1 event
// AON_SW               AON_SW event
// AON_PROG_WU          AON_PROG_WU event
// AUXIO0               AUXIO0 input data
// AUXIO1               AUXIO1 input data
// AUXIO2               AUXIO2 input data
// AUXIO3               AUXIO3 input data
// AUXIO4               AUXIO4 input data
// AUXIO5               AUXIO5 input data
// AUXIO6               AUXIO6 input data
// AUXIO7               AUXIO7 input data
// AUXIO8               AUXIO8 input data
// AUXIO9               AUXIO9 input data
// AUXIO10              AUXIO10 input data
// AUXIO11              AUXIO11 input data
// AUXIO12              AUXIO12 input data
// AUXIO13              AUXIO13 input data
// AUXIO14              AUXIO14 input data
// AUXIO15              AUXIO15 input data
// ACLK_REF             ACLK_REF event
// MCU_EV               MCU_EV event
// ADC_IRQ              ADC_IRQ event
//
#define AUX_EVCTL_VECCFG0_VEC0_EV_M                                 0x0000001F
#define AUX_EVCTL_VECCFG0_VEC0_EV_S                                 0
#define AUX_EVCTL_VECCFG0_VEC0_EV_AON_RTC_CH2                       0x00000000
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUX_COMPA                         0x00000001
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUX_COMPB                         0x00000002
#define AUX_EVCTL_VECCFG0_VEC0_EV_TDC_DONE                          0x00000003
#define AUX_EVCTL_VECCFG0_VEC0_EV_TIMER0_EV                         0x00000004
#define AUX_EVCTL_VECCFG0_VEC0_EV_TIMER1_EV                         0x00000005
#define AUX_EVCTL_VECCFG0_VEC0_EV_SMPH_AUTOTAKE_DONE                0x00000006
#define AUX_EVCTL_VECCFG0_VEC0_EV_ADC_DONE                          0x00000007
#define AUX_EVCTL_VECCFG0_VEC0_EV_ADC_FIFO_ALMOST_FULL              0x00000008
#define AUX_EVCTL_VECCFG0_VEC0_EV_OBSMUX0                           0x00000009
#define AUX_EVCTL_VECCFG0_VEC0_EV_OBSMUX1                           0x0000000A
#define AUX_EVCTL_VECCFG0_VEC0_EV_AON_SW                            0x0000000B
#define AUX_EVCTL_VECCFG0_VEC0_EV_AON_PROG_WU                       0x0000000C
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO0                            0x0000000D
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO1                            0x0000000E
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO2                            0x0000000F
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO3                            0x00000010
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO4                            0x00000011
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO5                            0x00000012
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO6                            0x00000013
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO7                            0x00000014
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO8                            0x00000015
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO9                            0x00000016
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO10                           0x00000017
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO11                           0x00000018
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO12                           0x00000019
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO13                           0x0000001A
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO14                           0x0000001B
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO15                           0x0000001C
#define AUX_EVCTL_VECCFG0_VEC0_EV_ACLK_REF                          0x0000001D
#define AUX_EVCTL_VECCFG0_VEC0_EV_MCU_EV                            0x0000001E
#define AUX_EVCTL_VECCFG0_VEC0_EV_ADC_IRQ                           0x0000001F

//*****************************************************************************
//
// Register: AUX_EVCTL_O_VECCFG1
//
//*****************************************************************************
// Field: [14]    VEC3_POL
//
// Selects vector 3 trigger event polarity.
//
// To manually trigger vector 3 execution, set VEC3_EV to a known static
// value, and toggle VEC3_POL twice.
// ENUMs:
// RISE                 Rising edge triggers execution.
// FALL                 Falling edge triggers execution.
//
#define AUX_EVCTL_VECCFG1_VEC3_POL                                  0x00004000
#define AUX_EVCTL_VECCFG1_VEC3_POL_BITN                             14
#define AUX_EVCTL_VECCFG1_VEC3_POL_M                                0x00004000
#define AUX_EVCTL_VECCFG1_VEC3_POL_S                                14
#define AUX_EVCTL_VECCFG1_VEC3_POL_RISE                             0x00000000
#define AUX_EVCTL_VECCFG1_VEC3_POL_FALL                             0x00004000

