GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_aux_evctl.h
// Field: [13]    VEC3_EN
//
// Enables (1) or disables (0) triggering of vector 3 execution.
//
// When enabled, the edge selected by VEC3_POL on the event selected by
// VEC3_EV will set VECFLAGS.VEC3, which in turn triggers vector 3 execution.
//
// Note: Lower vectors (0, 1 and 2) have priority.
// ENUMs:
// DIS                  Event detection is disabled
// EN                   An event selected by VEC3_EV with polarity from
// VEC3_POL triggers a jump to vector # 3 when AUX_SCE is in sleep
//
#define AUX_EVCTL_VECCFG1_VEC3_EN                                   0x00002000
#define AUX_EVCTL_VECCFG1_VEC3_EN_BITN                              13
#define AUX_EVCTL_VECCFG1_VEC3_EN_M                                 0x00002000
#define AUX_EVCTL_VECCFG1_VEC3_EN_S                                 13
#define AUX_EVCTL_VECCFG1_VEC3_EN_DIS                               0x00000000
#define AUX_EVCTL_VECCFG1_VEC3_EN_EN                                0x00002000

// Field: [12:8] VEC3_EV
//
// Selects vector 3 trigger source event.
// ENUMs:
// AON_RTC_CH2          AON_RTC_CH2 event
// AUX_COMPA            AUX_COMPA event
// AUX_COMPB            AUX_COMPB event
// TDC_DONE             TDC_DONE event
// TIMER0_EV            TIMER0_EV event
// TIMER1_EV            TIMER1_EV event
// SMPH_AUTOTAKE_DONE   SMPH_AUTOTAKE_DONE event
// ADC_DONE             ADC_DONE event
// ADC_FIFO_ALMOST_FULL ADC_FIFO_ALMOST_FULL event
// OBSMUX0              OBSMUX0 event
// OBSMUX1              OBSMUX1 event
// AON_SW               AON_SW event
// AON_PROG_WU          AON_PROG_WU event
// AUXIO0               AUXIO0 input data
// AUXIO1               AUXIO1 input data
// AUXIO2               AUXIO2 input data
// AUXIO3               AUXIO3 input data
// AUXIO4               AUXIO4 input data
// AUXIO5               AUXIO5 input data
// AUXIO6               AUXIO6 input data
// AUXIO7               AUXIO7 input data
// AUXIO8               AUXIO8 input data
// AUXIO9               AUXIO9 input data
// AUXIO10              AUXIO10 input data
// AUXIO11              AUXIO11 input data
// AUXIO12              AUXIO12 input data
// AUXIO13              AUXIO13 input data
// AUXIO14              AUXIO14 input data
// AUXIO15              AUXIO15 input data
// ACLK_REF             ACLK_REF event
// MCU_EV               MCU_EV event
// ADC_IRQ              ADC_IRQ event
//
#define AUX_EVCTL_VECCFG1_VEC3_EV_M                                 0x00001F00
#define AUX_EVCTL_VECCFG1_VEC3_EV_S                                 8
#define AUX_EVCTL_VECCFG1_VEC3_EV_AON_RTC_CH2                       0x00000000
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUX_COMPA                         0x00000100
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUX_COMPB                         0x00000200
#define AUX_EVCTL_VECCFG1_VEC3_EV_TDC_DONE                          0x00000300
#define AUX_EVCTL_VECCFG1_VEC3_EV_TIMER0_EV                         0x00000400
#define AUX_EVCTL_VECCFG1_VEC3_EV_TIMER1_EV                         0x00000500
#define AUX_EVCTL_VECCFG1_VEC3_EV_SMPH_AUTOTAKE_DONE                0x00000600
#define AUX_EVCTL_VECCFG1_VEC3_EV_ADC_DONE                          0x00000700
#define AUX_EVCTL_VECCFG1_VEC3_EV_ADC_FIFO_ALMOST_FULL              0x00000800
#define AUX_EVCTL_VECCFG1_VEC3_EV_OBSMUX0                           0x00000900
#define AUX_EVCTL_VECCFG1_VEC3_EV_OBSMUX1                           0x00000A00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AON_SW                            0x00000B00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AON_PROG_WU                       0x00000C00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO0                            0x00000D00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO1                            0x00000E00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO2                            0x00000F00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO3                            0x00001000
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO4                            0x00001100
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO5                            0x00001200
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO6                            0x00001300
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO7                            0x00001400
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO8                            0x00001500
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO9                            0x00001600
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO10                           0x00001700
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO11                           0x00001800
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO12                           0x00001900
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO13                           0x00001A00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO14                           0x00001B00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO15                           0x00001C00
#define AUX_EVCTL_VECCFG1_VEC3_EV_ACLK_REF                          0x00001D00
#define AUX_EVCTL_VECCFG1_VEC3_EV_MCU_EV                            0x00001E00
#define AUX_EVCTL_VECCFG1_VEC3_EV_ADC_IRQ                           0x00001F00

// Field: [6]    VEC2_POL
//
// Selects vector 2 trigger event polarity.
//
// To manually trigger vector 2 execution, set VEC2_EV to a known static
// value, and toggle VEC2_POL twice.
// ENUMs:
// RISE                 Rising edge triggers execution.
// FALL                 Falling edge triggers execution.
//
#define AUX_EVCTL_VECCFG1_VEC2_POL                                  0x00000040
#define AUX_EVCTL_VECCFG1_VEC2_POL_BITN                             6
#define AUX_EVCTL_VECCFG1_VEC2_POL_M                                0x00000040
#define AUX_EVCTL_VECCFG1_VEC2_POL_S                                6
#define AUX_EVCTL_VECCFG1_VEC2_POL_RISE                             0x00000000
#define AUX_EVCTL_VECCFG1_VEC2_POL_FALL                             0x00000040

// Field: [5]    VEC2_EN
//
// Enables (1) or disables (0) triggering of vector 2 execution.
//
// When enabled, the edge selected by VEC2_POL on the event selected by
// VEC2_EV will set VECFLAGS.VEC2, which in turn triggers vector 2 execution.
//
// Note: Lower vectors (0 and 1) have priority.
// ENUMs:
// DIS                  Event detection is disabled
// EN                   An event selected by VEC2_EV with polarity from
// VEC2_POL triggers a jump to vector # 2 when AUX_SCE is in sleep
//
#define AUX_EVCTL_VECCFG1_VEC2_EN                                   0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_BITN                              5
#define AUX_EVCTL_VECCFG1_VEC2_EN_M                                 0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_S                                 5
#define AUX_EVCTL_VECCFG1_VEC2_EN_DIS                               0x00000000
#define AUX_EVCTL_VECCFG1_VEC2_EN_EN                                0x00000020

// Field: [4:0] VEC2_EV
//
// Selects vector 2 trigger source event.
// ENUMs:
// AON_RTC_CH2          AON_RTC_CH2 event
// AUX_COMPA            AUX_COMPA event
// AUX_COMPB            AUX_COMPB event
// TDC_DONE             TDC_DONE event
// TIMER0_EV            TIMER0_EV event
// TIMER1_EV            TIMER1_EV event
// SMPH_AUTOTAKE_DONE   SMPH_AUTOTAKE_DONE event
// ADC_DONE             ADC_DONE event
// ADC_FIFO_ALMOST_FULL ADC_FIFO_ALMOST_FULL event
// OBSMUX0              OBSMUX0 event
// OBSMUX1              OBSMUX1 event
// AON_SW               AON_SW event
// AON_PROG_WU          AON_PROG_WU event
// AUXIO0               AUXIO0 input data
// AUXIO1               AUXIO1 input data
// AUXIO2               AUXIO2 input data
// AUXIO3               AUXIO3 input data
// AUXIO4               AUXIO4 input data
// AUXIO5               AUXIO5 input data
// AUXIO6               AUXIO6 input data
// AUXIO7               AUXIO7 input data
// AUXIO8               AUXIO8 input data
// AUXIO9               AUXIO9 input data
// AUXIO10              AUXIO10 input data
// AUXIO11              AUXIO11 input data
// AUXIO12              AUXIO12 input data
// AUXIO13              AUXIO13 input data
// AUXIO14              AUXIO14 input data
// AUXIO15              AUXIO15 input data
// ACLK_REF             ACLK_REF event
// MCU_EV               MCU_EV event
// ADC_IRQ              ADC_IRQ event
//
#define AUX_EVCTL_VECCFG1_VEC2_EV_M                                 0x0000001F
#define AUX_EVCTL_VECCFG1_VEC2_EV_S                                 0
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_RTC_CH2                       0x00000000
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUX_COMPA                         0x00000001
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUX_COMPB                         0x00000002
#define AUX_EVCTL_VECCFG1_VEC2_EV_TDC_DONE                          0x00000003
#define AUX_EVCTL_VECCFG1_VEC2_EV_TIMER0_EV                         0x00000004
#define AUX_EVCTL_VECCFG1_VEC2_EV_TIMER1_EV                         0x00000005
#define AUX_EVCTL_VECCFG1_VEC2_EV_SMPH_AUTOTAKE_DONE                0x00000006
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_DONE                          0x00000007
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_FIFO_ALMOST_FULL              0x00000008
#define AUX_EVCTL_VECCFG1_VEC2_EV_OBSMUX0                           0x00000009
#define AUX_EVCTL_VECCFG1_VEC2_EV_OBSMUX1                           0x0000000A
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_SW                            0x0000000B
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_PROG_WU                       0x0000000C
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO0                            0x0000000D
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO1                            0x0000000E
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO2                            0x0000000F
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO3                            0x00000010
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO4                            0x00000011
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO5                            0x00000012
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO6                            0x00000013
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO7                            0x00000014
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO8                            0x00000015
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO9                            0x00000016
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO10                           0x00000017
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO11                           0x00000018
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO12                           0x00000019
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO13                           0x0000001A
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO14                           0x0000001B
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO15                           0x0000001C
#define AUX_EVCTL_VECCFG1_VEC2_EV_ACLK_REF                          0x0000001D
#define AUX_EVCTL_VECCFG1_VEC2_EV_MCU_EV                            0x0000001E
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_IRQ                           0x0000001F

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SCEWEVSEL
//
//*****************************************************************************
// Field: [4:0] WEV7_EV
//
// Selects the event source to be mapped to [AUX_SCE.WUSTAT.EV_SIGNALS] bit 7.
// ENUMs:
// AON_RTC_CH2          AON_RTC_CH2 event
// AUX_COMPA            AUX_COMPA event
// AUX_COMPB            AUX_COMPB event
// TDC_DONE             TDC_DONE event
// TIMER0_EV            TIMER0_EV event
// TIMER1_EV            TIMER1_EV event
// SMPH_AUTOTAKE_DONE   SMPH_AUTOTAKE_DONE event
// ADC_DONE             ADC_DONE event
// ADC_FIFO_ALMOST_FULL ADC_FIFO_ALMOST_FULL event
// OBSMUX0              OBSMUX0 event
// OBSMUX1              OBSMUX1 event
// AON_SW               AON_SW event
// AON_PROG_WU          AON_PROG_WU event
// AUXIO0               AUXIO0 input data
// AUXIO1               AUXIO1 input data
// AUXIO2               AUXIO2 input data
// AUXIO3               AUXIO3 input data
// AUXIO4               AUXIO4 input data
// AUXIO5               AUXIO5 input data
// AUXIO6               AUXIO6 input data
// AUXIO7               AUXIO7 input data
// AUXIO8               AUXIO8 input data
// AUXIO9               AUXIO9 input data
// AUXIO10              AUXIO10 input data
// AUXIO11              AUXIO11 input data
// AUXIO12              AUXIO12 input data
// AUXIO13              AUXIO13 input data
// AUXIO14              AUXIO14 input data
// AUXIO15              AUXIO15 input data
// ACLK_REF             ACLK_REF event
// MCU_EV               MCU_EV event
// ADC_IRQ              ADC_IRQ event
//
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_M                               0x0000001F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_S                               0
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_RTC_CH2                     0x00000000
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUX_COMPA                       0x00000001
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUX_COMPB                       0x00000002
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TDC_DONE                        0x00000003
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TIMER0_EV                       0x00000004
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TIMER1_EV                       0x00000005
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_SMPH_AUTOTAKE_DONE              0x00000006
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_DONE                        0x00000007
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_FIFO_ALMOST_FULL            0x00000008
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_OBSMUX0                         0x00000009
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_OBSMUX1                         0x0000000A
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_SW                          0x0000000B
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_PROG_WU                     0x0000000C
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO0                          0x0000000D
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO1                          0x0000000E
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO2                          0x0000000F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO3                          0x00000010
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO4                          0x00000011
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO5                          0x00000012
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO6                          0x00000013
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO7                          0x00000014
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO8                          0x00000015
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO9                          0x00000016
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO10                         0x00000017
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO11                         0x00000018
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO12                         0x00000019
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO13                         0x0000001A
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO14                         0x0000001B
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO15                         0x0000001C
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ACLK_REF                        0x0000001D
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_MCU_EV                          0x0000001E
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_IRQ                         0x0000001F

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGS
//
//*****************************************************************************
// Field: [8]    TIMER1_EV
//
// TIMER1_EV event flag.
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV                            0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_BITN                       8
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_M                          0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_S                          8

// Field: [7]    TIMER0_EV
//
// TIMER0_EV event flag.
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV                            0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV_BITN                       7
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV_M                          0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV_S                          7

// Field: [6]    TDC_DONE
//
// TDC_DONE event flag.
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE                             0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE_BITN                        6
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE_M                           0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE_S                           6

// Field: [5]    ADC_DONE
//
// ADC_DONE event flag.
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE                             0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE_BITN                        5
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE_M                           0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE_S                           5

// Field: [4]    AUX_COMPB
//
// AUX_COMPB event flag.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB                            0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_BITN                       4
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_M                          0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_S                          4

// Field: [3]    AUX_COMPA
//
// AUX_COMPA event flag.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA                            0x00000008
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_BITN                       3
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_M                          0x00000008
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_S                          3

// Field: [2]    SWEV2
//
// SWEV2 event flag.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2                                0x00000004
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_BITN                           2
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_M                              0x00000004
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_S                              2

// Field: [1]    SWEV1
//
// SWEV1 event flag.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1                                0x00000002
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_BITN                           1
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_M                              0x00000002
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_S                              1

// Field: [0]    SWEV0
//
// SWEV0 event flag.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0                                0x00000001
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_BITN                           0
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_M                              0x00000001
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_S                              0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONPOL
//
//*****************************************************************************
// Field: [8]    TIMER1_EV
//
// Selects the event source level that sets EVTOAONFLAGS.TIMER1_EV.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV                              0x00000100
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_BITN                         8
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_M                            0x00000100
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_S                            8
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_HIGH                         0x00000000
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_LOW                          0x00000100

// Field: [7]    TIMER0_EV
//
// Selects the event source level that sets EVTOAONFLAGS.TIMER0_EV.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV                              0x00000080
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_BITN                         7
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_M                            0x00000080
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_S                            7
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_HIGH                         0x00000000
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_LOW                          0x00000080

// Field: [6]    TDC_DONE
//
// Selects the event source level that sets EVTOAONFLAGS.TDC_DONE.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE                               0x00000040
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_BITN                          6
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_M                             0x00000040
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_S                             6
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_HIGH                          0x00000000
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_LOW                           0x00000040

// Field: [5]    ADC_DONE
//
// Selects the event source level that sets EVTOAONFLAGS.ADC_DONE.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE                               0x00000020
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_BITN                          5
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_M                             0x00000020
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_S                             5
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_HIGH                          0x00000000
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_LOW                           0x00000020

// Field: [4]    AUX_COMPB
//
// Selects the event source level that sets EVTOAONFLAGS.AUX_COMPB.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB                              0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_BITN                         4
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_M                            0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_S                            4
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_HIGH                         0x00000000
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_LOW                          0x00000010

// Field: [3]    AUX_COMPA
//
// Selects the event source level that sets EVTOAONFLAGS.AUX_COMPA.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA                              0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_BITN                         3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_M                            0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_S                            3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_HIGH                         0x00000000
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_LOW                          0x00000008

//*****************************************************************************
//
// Register: AUX_EVCTL_O_DMACTL
//
//*****************************************************************************
// Field: [2]    REQ_MODE
//
// DMA Request mode
// ENUMs:
// BURST                Burst requests are generated on DMA channel 7 when the
// condition configured in SEL is met
// SINGLE               Single requests are generated on DMA channel 7 when the
// condition configured in SEL is met
//
#define AUX_EVCTL_DMACTL_REQ_MODE                                   0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BITN                              2
#define AUX_EVCTL_DMACTL_REQ_MODE_M                                 0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_S                                 2
#define AUX_EVCTL_DMACTL_REQ_MODE_BURST                             0x00000000
#define AUX_EVCTL_DMACTL_REQ_MODE_SINGLE                            0x00000004

