GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_aux_evctl.h
// Field: [4]    TIMER0_EV
//
// Selects the event source level that sets EVTOMCUFLAGS.TIMER0_EV.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV                              0x00000010
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_BITN                         4
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_M                            0x00000010
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_S                            4
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_HIGH                         0x00000000
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_LOW                          0x00000010

// Field: [3]    TDC_DONE
//
// Selects the event source level that sets EVTOMCUFLAGS.TDC_DONE.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_TDC_DONE                               0x00000008
#define AUX_EVCTL_EVTOMCUPOL_TDC_DONE_BITN                          3
#define AUX_EVCTL_EVTOMCUPOL_TDC_DONE_M                             0x00000008
#define AUX_EVCTL_EVTOMCUPOL_TDC_DONE_S                             3
#define AUX_EVCTL_EVTOMCUPOL_TDC_DONE_HIGH                          0x00000000
#define AUX_EVCTL_EVTOMCUPOL_TDC_DONE_LOW                           0x00000008

// Field: [2]    AUX_COMPB
//
// Selects the event source level that sets EVTOMCUFLAGS.AUX_COMPB.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB                              0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_BITN                         2
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_M                            0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_S                            2
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_HIGH                         0x00000000
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_LOW                          0x00000004

// Field: [1]    AUX_COMPA
//
// Selects the event source level that sets EVTOMCUFLAGS.AUX_COMPA.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA                              0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_BITN                         1
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_M                            0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_S                            1
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_HIGH                         0x00000000
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_LOW                          0x00000002

// Field: [0]    AON_WU_EV
//
// Selects the event source level that sets EVTOMCUFLAGS.AON_WU_EV
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_AON_WU_EV                              0x00000001
#define AUX_EVCTL_EVTOMCUPOL_AON_WU_EV_BITN                         0
#define AUX_EVCTL_EVTOMCUPOL_AON_WU_EV_M                            0x00000001
#define AUX_EVCTL_EVTOMCUPOL_AON_WU_EV_S                            0
#define AUX_EVCTL_EVTOMCUPOL_AON_WU_EV_HIGH                         0x00000000
#define AUX_EVCTL_EVTOMCUPOL_AON_WU_EV_LOW                          0x00000001

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUFLAGS
//
//*****************************************************************************
// Field: [10]    ADC_IRQ
//
// ADC_IRQ event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_IRQ                              0x00000400
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_IRQ_BITN                         10
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_IRQ_M                            0x00000400
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_IRQ_S                            10

// Field: [9]    OBSMUX0
//
// OBSMUX0 event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_OBSMUX0                              0x00000200
#define AUX_EVCTL_EVTOMCUFLAGS_OBSMUX0_BITN                         9
#define AUX_EVCTL_EVTOMCUFLAGS_OBSMUX0_M                            0x00000200
#define AUX_EVCTL_EVTOMCUFLAGS_OBSMUX0_S                            9

// Field: [8]    ADC_FIFO_ALMOST_FULL
//
// ADC_FIFO_ALMOST_FULL event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_FIFO_ALMOST_FULL                 0x00000100
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_FIFO_ALMOST_FULL_BITN            8
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_FIFO_ALMOST_FULL_M               0x00000100
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_FIFO_ALMOST_FULL_S               8

// Field: [7]    ADC_DONE
//
// ADC_DONE event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_DONE                             0x00000080
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_DONE_BITN                        7
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_DONE_M                           0x00000080
#define AUX_EVCTL_EVTOMCUFLAGS_ADC_DONE_S                           7

// Field: [6]    SMPH_AUTOTAKE_DONE
//
// SMPH_AUTOTAKE_DONE event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_SMPH_AUTOTAKE_DONE                   0x00000040
#define AUX_EVCTL_EVTOMCUFLAGS_SMPH_AUTOTAKE_DONE_BITN              6
#define AUX_EVCTL_EVTOMCUFLAGS_SMPH_AUTOTAKE_DONE_M                 0x00000040
#define AUX_EVCTL_EVTOMCUFLAGS_SMPH_AUTOTAKE_DONE_S                 6

// Field: [5]    TIMER1_EV
//
// TIMER1_EV event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER1_EV                            0x00000020
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER1_EV_BITN                       5
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER1_EV_M                          0x00000020
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER1_EV_S                          5

// Field: [4]    TIMER0_EV
//
// TIMER0_EV event flag.
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV                            0x00000010
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV_BITN                       4
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV_M                          0x00000010
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV_S                          4

